<?php

include("functions.php");

$chess = new Chess;


$chess->runTest(
	"",
	"1, 1, 2, 8, 5",
	"Вы ввели более 4х чисел",
	"1, 1, 2, 8, 5 - Вы ввели более 4х чисел: "
);

$chess->runTest(
	"",
	"1, 1, 2, 9",
	"Такой клетки нет на поле",
	"1, 1, 2, 9 - Такой клетки нет на поле: "
);

$chess->runTest(
	"",
	"1, 1, 8, 8",
	"Да",
	"Ввод - '1, 1, 8, 8 - Да: "
);

$chess->runTest(
	"",
	"1, 1, d, 8",
	"Данные введены некорректно",
	"Ввод - '1, 1, d, 8 - Данные введены некорректно: "
);

$chess->runTest(
	"",
	"2, 2, 8, 2",
	"Да",
	"2, 2, 8, 2 - Да: "
);

$chess->runTest(
	"",
	"1, 3, 1, 8",
	"Да",
	"1, 3, 1, 8 - Да: "
);

$chess->runTest(
	"",
	"1, 1, 2, 5",
	"Нет",
	"1, 1, 2, 5 - Нет: "
);

var_dump($chess->start("Введите последовательность чисел через запятую, разделяя пробелом: "));




